profile_artifacts/_mermaid_diagrams/GMDM_Class_Diagrams_Mermaid.md
```mermaid
classDiagram
    class Identity {
        <<abstract>>
        +identifier: string
    }
    
    class IdentifiedObject {
        <<abstract>>
        +description: string [0..1]
        +name: string [0..1]
    }
    
    class PowerSystemResource {
        <<abstract>>
    }
    
    class Equipment {
        <<abstract>>
    }
    
    class ConductingEquipment {
        <<abstract>>
    }
    
    class EnergyConnection {
        <<abstract>>
    }
    
    class RegulatingCondEq {
        <<abstract>>
    }
    
    class RotatingMachine {
        <<abstract>>
        +ratedS: ApparentPower
        +ratedU: Voltage
    }
    
    class Conductor {
        <<abstract>>
        +length: Length
    }
    
    class Switch {
        <<abstract>>
        +ratedCurrent: CurrentFlow
    }
    
    class ProtectedSwitch {
        <<abstract>>
        +breakingCapacity: CurrentFlow [0..1]
    }
    
    class ShuntCompensator {
        <<abstract>>
        +aVRDelay: Seconds [0..1]
        +maximumSections: integer
        +nomU: Voltage
        +normalSections: integer
    }
    
    class ShuntCompensatorPhase {
        <<abstract>>
        +maximumSections: integer
        +normalSections: integer
    }
    
    class GeneratingUnit {
        <<abstract>>
        +ratedGrossMaxP: ActivePower [0..1]
    }
    
    class PowerElectronicsUnit {
        <<abstract>>
        +maxP: ActivePower
        +minP: ActivePower
    }
    
    class PowerElectronicsConnection {
        <<abstract>>
        +controlMode: ConverterControlModeKind [0..1]
        +maxQ: ReactivePower [0..1]
        +minQ: ReactivePower [0..1]
        +ratedS: ApparentPower
        +ratedU: Voltage
    }
    
    class ConnectivityNodeContainer {
        <<abstract>>
    }
    
    class ACDCTerminal {
        <<abstract>>
    }
    
    class TransformerEnd {
        <<abstract>>
        +grounded: boolean
        +rground: Resistance [0..1]
        +xground: Reactance [0..1]
    }
    
    class PerLengthLineParameter {
        <<abstract>>
    }
    
    class PerLengthImpedance {
        <<abstract>>
    }
    
    class TapChanger {
        <<abstract>>
        +controlEnabled: boolean
        +ctRatio: float [0..1]
        +highStep: integer
        +initialDelay: Seconds [0..1]
        +lowStep: integer
        +ltcFlag: boolean
        +neutralStep: integer
        +neutralU: Voltage
        +ptRatio: float [0..1]
        +subsequentDelay: Seconds [0..1]
    }
    
    class RegulatingControl {
        <<abstract>>
        +discrete: boolean
        +enabled: boolean
        +mode: RegulatingControlModeKind [0..1]
        +monitoredPhase: PhaseCode [0..1]
        +targetDeadband: float [0..1]
        +targetValue: float [0..1]
    }
    
    class ACLineSegment {
        <<Description>>
    }
    
    class ACLineSegmentPhase {
        <<Description>>
        +sequenceNumber: integer
    }
    
    class AsynchronousMachine {
        <<Description>>
    }
    
    class SynchronousMachine {
        <<Description>>
    }
    
    class BatteryUnit {
        +ratedE: RealEnergy [0..1]
    }
    
    class PhotoVoltaicUnit {
    }
    
    class PowerElectronicsWindUnit {
    }
    
    class PowerElectronicsThermalUnit {
    }
    
    class Breaker {
        <<Description>>
    }
    
    class Disconnector {
        <<Description>>
    }
    
    class EnergyConsumer {
        <<Description>>
    }
    
    class EnergySource {
        <<Description>>
        +nominalVoltage: Voltage
        +r: Resistance
        +x: Reactance
    }
    
    class FossilFuel {
        +fossilFuelType: FuelType
    }
    
    class Fuse {
        <<Description>>
    }
    
    class LinearShuntCompensator {
        <<Description>>
        +bPerSection: Susceptance
        +gPerSection: Conductance
    }
    
    class LinearShuntCompensatorPhase {
        <<Description>>
        +bPerSection: Susceptance
        +gPerSection: Conductance
    }
    
    class LoadBreakSwitch {
        <<Description>>
    }
    
    class LoadResponseCharacteristic {
        +exponentModel: boolean [0..1]
        +pConstantCurrent: float [0..1]
        +pConstantImpedance: float [0..1]
        +pConstantPower: float [0..1]
        +pFrequencyExponent: float [0..1]
        +pVoltageExponent: float [0..1]
        +qConstantCurrent: float [0..1]
        +qConstantImpedance: float [0..1]
        +qConstantPower: float [0..1]
        +qFrequencyExponent: float [0..1]
        +qVoltageExponent: float [0..1]
    }
    
    class PerLengthPhaseImpedance {
        +conductorCount: integer
    }
    
    class PhaseImpedanceData {
        +b: SusceptancePerLength
        +column: integer
        +r: ResistancePerLength
        +row: integer
        +x: ReactancePerLength
    }
    
    class PowerTransformer {
        <<Description>>
    }
    
    class PowerTransformerEnd {
        <<Description>>
        +b: Susceptance [0..1]
        +g: Conductance [0..1]
        +phaseAngleClock: integer [0..1]
        +r: Resistance
        +ratedS: ApparentPower
        +ratedU: Voltage
        +x: Reactance [0..1]
    }
    
    class RatioTapChanger {
        +stepVoltageIncrement: PerCent [0..1]
    }
    
    class Recloser {
        <<Description>>
    }
    
    class Sectionaliser {
        <<Description>>
    }
    
    class SeriesCompensator {
        <<Description>>
    }
    
    class TapChangerControl {
        +lineDropCompensation: boolean
        +lineDropR: Resistance [0..1]
        +lineDropX: Reactance [0..1]
        +maxLimitVoltage: Voltage
        +minLimitVoltage: Voltage
        +reverseLineDropR: Resistance [0..1]
        +reverseLineDropX: Reactance [0..1]
        +reverseTargetDeadband: Voltage [0..1]
        +reverseTargetValue: Voltage [0..1]
        +reverseToNeutral: boolean [0..1]
        +reversible: boolean
        +reversingDelay: Seconds [0..1]
        +reversingPowerThreshold: ApparentPower [0..1]
    }
    
    class Terminal {
        <<Description>>
    }
    
    class ThermalGeneratingUnit {
    }
    
    class TransformerCoreAdmittance {
        +b: Susceptance
        +g: Conductance
    }
    
    class TransformerMeshImpedance {
        +r: Resistance
        +x: Reactance
    }
    
    class TransformerTankEnd {
        <<Description>>
    }
    
    class WindGeneratingUnit {
        +windGenUnitType: WindGenUnitKind [0..1]
    }
    
    class ConverterControlModeKind {
        <<enumeration>>
        constantPowerFactor
        constantReactivePower
        dynamic
    }
    
    class FuelType {
        <<enumeration>>
        brownCoalLignite
        coal
        coalDerivedGas
        gas
        hardCoal
        lignite
        oil
        oilShale
        other
        peat
    }
    
    class PhaseCode {
        <<enumeration>>
        A
        AB
        ABC
        ABCN
        ABN
        AC
        ACN
        AN
        B
        BC
        BCN
        BN
        C
        CN
        N
        X
        XN
        XY
        XYN
        none
        ... [11 more literals]
    }
    
    class RegulatingControlModeKind {
        <<enumeration>>
        activePower
        admittance
        currentFlow
        powerFactor
        reactivePower
        temperature
        timeScheduled
        voltage
    }
    
    class WindGenUnitKind {
        <<enumeration>>
        offshore
        onshore
    }
    
    Identity <|-- IdentifiedObject
    Identity <|-- PhaseImpedanceData
    IdentifiedObject <|-- PowerSystemResource
    IdentifiedObject <|-- FossilFuel
    IdentifiedObject <|-- LoadResponseCharacteristic
    IdentifiedObject <|-- PerLengthLineParameter
    IdentifiedObject <|-- TransformerCoreAdmittance
    IdentifiedObject <|-- TransformerMeshImpedance
    IdentifiedObject <|-- ACDCTerminal
    IdentifiedObject <|-- TransformerEnd
    PowerSystemResource <|-- Equipment
    PowerSystemResource <|-- ConnectivityNodeContainer
    PowerSystemResource <|-- ACLineSegmentPhase
    PowerSystemResource <|-- ShuntCompensatorPhase
    PowerSystemResource <|-- RegulatingControl
    PowerSystemResource <|-- TapChanger
    Equipment <|-- ConductingEquipment
    Equipment <|-- GeneratingUnit
    Equipment <|-- PowerElectronicsUnit
    ConductingEquipment <|-- EnergyConnection
    ConductingEquipment <|-- Conductor
    ConductingEquipment <|-- Switch
    ConductingEquipment <|-- PowerTransformer
    ConductingEquipment <|-- SeriesCompensator
    EnergyConnection <|-- RegulatingCondEq
    EnergyConnection <|-- EnergyConsumer
    EnergyConnection <|-- EnergySource
    RegulatingCondEq <|-- RotatingMachine
    RegulatingCondEq <|-- PowerElectronicsConnection
    RegulatingCondEq <|-- ShuntCompensator
    RotatingMachine <|-- AsynchronousMachine
    RotatingMachine <|-- SynchronousMachine
    Conductor <|-- ACLineSegment
    Switch <|-- ProtectedSwitch
    Switch <|-- Disconnector
    Switch <|-- Fuse
    Switch <|-- Sectionaliser
    ProtectedSwitch <|-- Breaker
    ProtectedSwitch <|-- LoadBreakSwitch
    ProtectedSwitch <|-- Recloser
    ShuntCompensator <|-- LinearShuntCompensator
    ShuntCompensatorPhase <|-- LinearShuntCompensatorPhase
    GeneratingUnit <|-- ThermalGeneratingUnit
    GeneratingUnit <|-- WindGeneratingUnit
    PowerElectronicsUnit <|-- BatteryUnit
    PowerElectronicsUnit <|-- PhotoVoltaicUnit
    PowerElectronicsUnit <|-- PowerElectronicsWindUnit
    PowerElectronicsUnit <|-- PowerElectronicsThermalUnit
    PerLengthLineParameter <|-- PerLengthImpedance
    PerLengthImpedance <|-- PerLengthPhaseImpedance
    TapChanger <|-- RatioTapChanger
    RegulatingControl <|-- TapChangerControl
    TransformerEnd <|-- PowerTransformerEnd
    TransformerEnd <|-- TransformerTankEnd
    ACDCTerminal <|-- Terminal
    
    ACLineSegment --> PerLengthImpedance : "0..1"
    EnergyConsumer --> LoadResponseCharacteristic : "0..1"
    GeneratingUnit --> RotatingMachine : "1"
    PowerElectronicsUnit --> PowerElectronicsConnection : "0..1"
    PowerElectronicsThermalUnit --> FossilFuel : "0..1"
    ThermalGeneratingUnit --> FossilFuel : "0..*"
    PhaseImpedanceData --> PerLengthPhaseImpedance : "1"
    RatioTapChanger --> TransformerEnd : "1"
    RegulatingCondEq --> RegulatingControl : "0..1"
    RegulatingControl --> Terminal : "1"
    TapChanger --> TapChangerControl : "1"
    TransformerEnd --> TransformerCoreAdmittance : "0..1"
    TransformerMeshImpedance --> TransformerEnd : "FromTransformerEnd 0..1"
    TransformerMeshImpedance --> TransformerEnd : "ToTransformerEnd 0..*"
```
